Revit 2027 API
BuiltInFailures.StairRampFailures.RunTopLowerThanBottomFailure Property
 The top elevation for the run is lower than the base elevation for the run.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RunTopLowerThanBottomFailure { get; }
Public Shared ReadOnly Property RunTopLowerThanBottomFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RunTopLowerThanBottomFailure {
	FailureDefinitionId^ get ();
}
static member RunTopLowerThanBottomFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace